Autodesk.Revit.DB.SpatialElementGeometryCalculator.GetOptions
The options that control the calculation.
Returns:
The options.
Since:
2012

Autodesk.Revit.DB.SpatialElementGeometryCalculator.CanCalculateGeometry(Autodesk.Revit.DB.SpatialElement)
This indicates whether the input spatial element is a valid one.
spatialElement:
The spatial element to be checked if its geometry can be calculated.
Returns:
It will return false if the room/space is not enclosed in 2d or has no location, or the height is too small.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.SpatialElementGeometryCalculator.IsRoomOrSpace(Autodesk.Revit.DB.SpatialElement)
This indicates whether the input spatial element is a room or a space.
spatialElement:
The spatial element to be checked if it is a room or a space or not.
Returns:
True if the input spatial element is a room or a space, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.SpatialElementGeometryCalculator.CalculateSpatialElementGeometry(Autodesk.Revit.DB.SpatialElement)
Compute the spatial element geometry and returns the boundary face information.
spatialElement:
Specifies the spatial element needs to be computed, should be Room or Space.
Returns:
Requested boundary face information.
Throws Autodesk.Revit.Exceptions.ArgumentException:
spatialElement is not a room or a space, and thus has no 3D geometry to calculate.
-or-
spatialElement is not enclosed in 2d or has no location, or the height is too small, and thus has no 3D geometry to calculate.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to compute the given spatial element's geometry.
Since:
2012

Autodesk.Revit.DB.SpatialElementGeometryCalculator.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.SpatialElementGeometryCalculator.#ctor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.SpatialElementBoundaryOptions)
Constructs a new calculator for the geometry of spatial elements.
aDoc:
The document that contains the spatial elements.
options:
The options to control the calculation rules.
Throws Autodesk.Revit.Exceptions.ArgumentException:
options is not valid.  Only Finish and Center of SpatialElementBoundaryLocation are allowed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.SpatialElementGeometryCalculator.#ctor(Autodesk.Revit.DB.Document)
Constructs a new calculator with default options for the geometry of spatial elements.
aDoc:
The document that contains the spatial elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.SpatialElementGeometryCalculator
Use this class to calculate the geometry of a spatial element and obtain the relationships between the geometry and
the element's boundary elements.
Remarks:
This class maintains an internal cache for geometry it has already processed. If you intend to calculate geometry
for several elements in the same project you should use a single instance of this class. Note that the cache will
be cleared when any change is made to the document.
Since:
2012